#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+TITLE: Sortowanie topologiczne grafu
* przykład działania 
#+BEGIN_SRC ocaml :exports both
  #load "pMap.cmo";;
  #load "topol.cmo";;
  open Topol

  let grafik =
    [
      (1, [2; 3; 4]);
      (2, [3; 4]);
      (2, [3; 4]);
      (3, [4; 5]);
      (4, [5]);
      (4, [5]);
      (1, [2; 3; 4]);
    ];;

  topol grafik
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 | 5 |

